{
    "I": {
        "Short": "I",
        "Name": "Introversion",
        "Description": "Prefers solitude and deep focus. Energized by inner thoughts rather than social interactions. Values introspection, quiet environments, and deep conversations over small talk."
    },
    "E": {
        "Short": "E",
        "Name": "Extraversion",
        "Description": "Gains energy from social interactions and active engagement with others. Thrives in group settings, enjoys discussions, and prefers external stimulation over solitude."
    },
    "N": {
        "Short": "N",
        "Name": "Intuition",
        "Description": "Focuses on abstract thinking, patterns, and future possibilities. Prefers big-picture concepts over immediate details and enjoys exploring imaginative and theoretical ideas."
    },
    "S": {
        "Short": "S",
        "Name": "Sensing",
        "Description": "Relies on concrete facts, direct experience, and real-world applications. Prefers practical knowledge, paying attention to detail, and dealing with tangible reality."
    },
    "T": {
        "Short": "T",
        "Name": "Thinking",
        "Description": "Makes decisions based on logic, analysis, and objectivity. Values efficiency and rational problem-solving over emotions and personal values."
    },
    "F": {
        "Short": "F",
        "Name": "Feeling",
        "Description": "Prioritizes emotions, empathy, and personal values when making decisions. Focuses on harmony, relationships, and understanding people’s needs over cold logic."
    },
    "J": {
        "Short": "J",
        "Name": "Judging",
        "Description": "Prefers structure, order, and planning. Likes having clear goals, schedules, and a well-organized life. Tends to be decisive and methodical in approaching tasks."
    },
    "P": {
        "Short": "P",
        "Name": "Perceiving",
        "Description": "Flexible and adaptable, prefers spontaneity over rigid plans. Enjoys exploring new possibilities, keeping options open, and adapting to changing circumstances rather than sticking to a strict schedule."
    }
}
